#include <stdio.h>

int main (void)
{
  double a, b, c;

  a = 1.0 / 1e307; // aはすごく小さな数
  printf("a= %25.20e\n", a);

  b= a / 3e16;   // aをある数で除して、同じ数を乗ずる
  b= b * 3e16;   // aに戻るか? 64bit演算だと戻らなくて正常
  printf("b= %25.20e\n", b);

  c= a / 3e16 * 3e16; // 内部表現が80bitだと戻ってしまう
  printf("c= %25.20e\n", c);

  return 0;
}

/*
   % gcc -msse2 -mfpmath=sse double.c
   % ./a.out
   a= 1.00000000000000010695e-307
   b= 1.48219693752373963253e-307
   c= 1.48219693752373963253e-307 // 64ビット精度なので戻らない

   % gcc -mfpmath=387 double.c 
   % ./a.out
   a= 1.00000000000000010695e-307
   b= 1.48219693752373963253e-307
   c= 1.00000000000000010695e-307 // 80ビット精度なので戻る
*/
